<template>
  <div class="container">
    <common-header></common-header>
    <div class="content">
      <div class="title">用户协议</div>
      <p class="p">美编致力于为您提供全面的微信公众号运营及管理服务，为充分保护您对于美编提供的各项服务的知情权，美编就其提供的各项服务的相关性、有效性以及限制性特制定了本《用户协议》（下称《协议》）。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本《协议》各项条款的约束。</p>
      <div class="sub-title">一、使用须知</div>
      <div class="p">1. 用户充分了解并同意，美编仅为用户管理微信公众号的平台，用户必须为自己注册帐号下的一切行为负责，包括您所传送的任何内容以及由此产生的任何结果。用户应对美编中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。美编无法且不会对因用户行为而导致的任何损失或损害承担责任。</div>
      <div class="p">2. 用户在美编服务中或通过美编服务所传送的任何内容并不反映美编的观点或政策，美编对此不承担任何责任。</div>
      <div class="p">3. 用户须对在美编上的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义传播任何信息；不得恶意使用注册帐号导致其他用户误认；否则美编有权立即停止提供服务，收回美编帐号并由用户独自承担由此而产生的一切法律责任。</div>
      <div class="p">4. 美编为了改善用户体验、完善服务内容，单方面对本服务的全部或部分服务内容在任何时候不经任何通知的情况下变更、暂停、限制、终止或撤销美编服务的权利，用户需承担此风险。</div>
      <div class="p">5. 美编帐号的所有权归美编所有，用户完成申请注册手续后，获得美编帐号的使用权，该使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖。美编因经营需要，有权回收用户的帐号。</div>
      <div class="p">6. 用户有权更改、删除在美编上的个人资料、注册信息及传送内容等，但需注意，删除有关信息的同时也会删除任何您储存在系统中的文字和图片。用户需承担该风险。</div>
      <div class="p">7. 用户有责任妥善保管注册帐号信息及帐号密码的安全，用户需要对注册帐号以及密码下的行为承担法律责任。用户同意在任何情况下不使用其他成员的帐号或密码。在您怀疑他人在使用您的帐号或密码时，您同意立即通知美编。</div>
      <div class="p">
        8. 用户不得利用美编或美编服务制作、上载、复制、发送如下内容：
        <div class="p1">(1) 反对宪法所确定的基本原则的；</div>
        <div class="p1">(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</div>
        <div class="p1">(3) 损害国家荣誉和利益的；</div>
        <div class="p1">(4) 煽动民族仇恨、民族歧视，破坏民族团结的；</div>
        <div class="p1">(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；</div>
        <div class="p1">(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；</div>
        <div class="p1">(7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</div>
        <div class="p1">(8) 侮辱或者诽谤他人，侵害他人合法权益的；</div>
        <div class="p1">(9) 含有法律、行政法规禁止的其他内容的信息。</div>
      </div>
      <div class="p">9. 用户应遵守本协议的各项条款，正确、适当地使用本服务，如因用户违反本协议中的任何条款，美编有权依据协议终止对违约用户帐号提供服务。同时，美编保留在任何时候收回美编帐号、用户名的权利。</div>
      <div class="sub-title">二、知识产权</div>
      <div class="p">1.  美编及美编所使用的任何相关软件、程序、内容，包括但不限于作品、图片、档案、资料、网站构架、网站版面的安排、网页设计、经由美编或广告商向用户呈现的广告或资讯，均由美编或其它权利人依法享有相应的知识产权，包括但不限于著作权、商标权、专利权或其它专属权利等，受到相关法律的保护。未经美编或权利人明示授权，用户保证不修改、出租、出借、出售、散布美编及美编所使用的上述任何资料和资源，或根据上述资料和资源制作成任何种类物品。</div>
      <div class="p">2.  美编授予用户不可转移及非专属的使用权，使用户可以通过单机计算机使用美编的目标代码（以下简称"软件"），但用户不得且不得允许任何第三方，复制、修改、创作衍生作品、进行还原工程、反向组译，或以其它方式破译或试图破译源代码，或出售、转让"软件"或对"软件 "进行再授权，或以其它方式移转"软件"之任何权利。用户同意不以任何方式修改"软件"，或使用修改后的"软件"。</div>
      <div class="p">3.  用户应保证，在使用美编产品服务时上传的文字、图片、视频、软件以及表演等的信息不侵犯任何第三方知识产权，包括但不限于商标权、著作权等。若用户在使用美编产品服务时上传的文字、图片、视频、软件以及表演等的信息中侵犯第三方知识产权，美编有权移除该侵权产品，并对此不负任何责任。用户应当负责处理前述第三方的权利主张，承担由此产生的全部费用，包括但不限于侵权赔偿、律师费及其他合理费用，美编不会因此而遭受任何损失</div>
      <div class="sub-title">三、隐私保护</div>
      <div class="p">1.  美编将会采取合理的措施保护用户的个人隐私信息，除法律或有法律赋予权限的政府部门要求或用户同意等原因外，美编未经用户同意不向除合作单位以外的第三方公开、 透露用户个人隐私信息。</div>
      <div class="p">2.  用户在注册时选择同意，或用户与美编及合作单位之间就用户个人隐私信息公开或使用另有约定的除外，同时用户应自行承担因此可能产生的任何风险，美编对此不予负责。</div>
      <div class="p">3.  用户在使用美编服务时不应将自认为隐私的信息发表、上传至美编，也不应将该等信息通过美编的服务传播给其他人，由于用户的行为引起的隐私泄漏，由用户自行承担责任。</div>
      <div class="p">4.  为了运营和改善美编的技术和服务，美编将可能会自行收集使用或向第三方提供用户的非个人隐私信息，这将有助于美编向用户提供更好的用户体验和提高美编的服务质量。</div>
      <div class="p">5.  请用户注意勿在使用美编服务中透露自己的各类财产帐户、银行卡、信用卡、第三方支付账户及对应密码等重要信息资料，否则由此带来的任何损失由用户自行承担。</div>
      <div class="p">6.  用户的帐号、密码属于保密信息，美编会努力采取积极的措施保护用户帐号、密码的安全，但美编不能就此提供绝对保证。</div>
      <div class="p">7.  互联网的开放性以及技术更新速度快，因非美编可控制的因素导致用户信息泄漏的，美编不承担任何责任。</div>
      <div class="sub-title">四、免责声明</div>
      <div class="p">1.  用户违反本《协议》或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户同意赔偿美编与合作公司、关联公司，并使之免受损害。</div>
      <div class="p">2.  用户因第三方如电信部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力原因而遭受的一切损失，美编及合作单位不承担责任。</div>
      <div class="p">3.  因技术故障等不可抗事件影响到服务的正常运行的，美编及合作单位承诺在第一时间内与相关单位配合，及时处理进行修复，但用户因此而遭受的一切损失，美编及合作单位不承担责任。</div>
      <div class="p">4.  本服务同大多数互联网服务一样，包括但不限于用户原因、网络服务质量、社会环境等因素的差异影响，可能受到各种安全问题的侵扰。用户应加强信息安全及使用者资料的保护意识，要注意加强密码保护，以免遭致损失和骚扰。</div>
      <div class="p">5.  用户须明白，使用本服务因涉及Internet服务，可能会受到各个环节不稳定因素的影响。因此，本服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险。用户须承担以上风险，美编不作担保。对因此导致用户不能发送和接受阅读信息、或接发错信息，美编不承担任何责任。</div>
      <div class="p">6.  在使用本服务过程中存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）的匿名或冒名的信息的风险，用户须承担以上风险，美编和合作公司对本服务不作任何类型的担保，不论是明确的或隐含的，包括所有有关信息真实性、适商性、适于某一特定用途、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。</div>
      <div class="p">7.  用户自美编提供的产品或服务所取得的任何建议或信息，无论是书面或口头形式，除非本协议有明确规定，将不构成本协议以外之任何保证。</div>
      <div class="p">8.  美编提供的所有信息、资讯、内容和服务均来自互联网，并不代表美编的观点，美编对其真实性、合法性概不负责，亦不承担任何法律责任。</div>
      <div class="sub-title">五、其他</div>
      <div class="p">1.  用户注册并使用了美编的商品或服务，即表示您已阅读并同意受本协议的约束。</div>
      <div class="p">2.  本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</div>
      <div class="p">3.  本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</div>
      <div class="p">4.  本《协议》的版权由美编所有，美编保留一切解释和修改权利。</div>
    </div>
  </div>
</template>

<script>
  import CommonHeader from '@/components/commonHeader'
  export default {
    name: "protocol",
    components:{CommonHeader}
  }
</script>

<style lang="stylus" scoped>
  .content
    width 12rem
    margin 0 auto
    margin-top 1.2rem
    padding 0.4rem
    box-sizing border-box
    background-color white
    font-size 0.16rem
    font-family PingFang-SC-Medium
    font-weight 500
    color #475766
    line-height 0.32rem
    .title
      font-size 0.28rem
      margin-bottom 0.31rem
    .sub-title
      font-size 0.2rem
      font-weight bold
      margin 0.31rem 0 0.22rem 0
    .p
      font-size 0.16rem
</style>
